fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоДней</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьДни();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДни()
	
	ТекСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДатаНачала) 
		И ЗначениеЗаполнено(ТекСтрока.ДатаОкончания) Тогда
		
		// В сутках 86400 секунд. +1, т.к. дни включительно.
		ТекСтрока.ВсегоДней = (ТекСтрока.ДатаОкончания - ТекСтрока.ДатаНачала) / 86400 + 1;
		
	Иначе
		ТекСтрока.ВсегоДней = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	// 1. Помещаем текущие данные формы (Объект) во временное хранилище
	// УникальныйИдентификатор нужен, чтобы хранилище жило пока жива форма
	АдресХранилища = ПоместитьВоВременноеХранилище(Объект, УникальныйИдентификатор);
	
	// 2. Готовим параметры для открытия второй формы
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресХранилища);
	
	// 3. Открываем форму анализа
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы);
	
КонецПроцедуры
